In [1]:
import sys
sys.path.insert(0,'/Users/jarad/fake_folder/Python Libraries')
from jb_libraries import *
%matplotlib inline

### From Rox via hipchat:
* Main account is 21000 payroll liabilities and 21995 is a sub account
* In QB > Lists

### To Do
* match what we pay wageworks and what they charge us
* match what we pay wageworks and what we take out of employees checks
* check out account fees, see what's up
* check out latest month of wageworks for employees who've, etc. (do this last)

### To get from WageWorks
* totals from beginning up to and including may 2018
    * accounts total
    * service fee
    * processing fee
    
### Initial audit
* From the beginning up to but not including June 1, 2018

### Get data from QB

In [103]:
# get data
csv_super_main = pd.read_csv(r'/Users/jarad/fake_folder/Finance/Recurring/WageWorks Audit/Docs/First CSVs/From QB/Copy of WageWorks - From the beginning to June 1, 2018.csv')

# make a copy
csv_main = csv_super_main.copy()

# lowercase
csv_main.columns = [x.lower() for x in csv_main.columns]

# turn into numbers
ls = ['amount','balance']
for col in ls:
    csv_main[col] = csv_main[col].str.replace(',','')
    csv_main[col] = pd.to_numeric(csv_main[col])
    
# make dates    
csv_main['date'] = pd.to_datetime(csv_main['date'])
csv_main['year and month'] = [str(x)[:7] for x in csv_main['date']]    
csv_main['year'] = [str(x)[:4] for x in csv_main['date']]

# drop these cols
for i in range(3):
    csv_main.drop(['unnamed: ' + str(i)],1,inplace = True)
    
# drop all nans
for i in range(2):
    csv_main.dropna(how = 'all', axis = i, inplace = True) 
    
# no date nulls
csv_main = csv_main[csv_main['date'].isnull() == False]    

# fill na
csv_main['name'].fillna(csv_main['memo'], inplace = True)

# lowercase
for col in csv_main.columns:
    try:
        csv_main[col] = [x.lower() for x in csv_main[col]]
    except:
        pass

# drop zero    
csv_main.drop(csv_main[csv_main['amount'] == 0].index, inplace = True)    
    
# make new columns    
csv_main['balance impact'] = np.where(csv_main['amount'] < 0, 'debit','credit')

# restrict by date, get only up until and including may 2018
csv_main = csv_main[csv_main['date'] <= '2018-05-31']

# get dates
min_ = csv_main['date'].min().date()
max_ = csv_main['date'].max().date()

print('data from %s to %s' % (min_,max_))

data from 2014-08-05 to 2018-05-18

### View "splits" column

In [104]:
csv_main['split'].value_counts()

10010 · chase chk - 1937    6857
66010 · taxes                 74
66005 · service fee            2
Name: split, dtype: int64

### Create a new "name 2" column 
* The "name" column has either an employee name, or some variation on of the word "WageWorks"
*****
* If the transaction is associated with an employee:
    * credit: money from their paycheck to our account
    * debit: money from our account to their paycheck (refund for cancelled WageWorks, etc.)
*****    
* If the transaction is associated with WageWorks:
    * credit: refund from WageWorks
    * debit: payment to WageWorks

In [105]:
ls = ['2015 service fee adjustment',
      '2016 service fee adjustment',
      'commuter benefits wageworks',
      'wageworks/commuter express']

csv_main['name 02'] = np.where(csv_main['name'].isin(ls), 'wageworks transaction', 'employee transaction')

In [106]:
s = csv_main.groupby(['name 02','balance impact'])[['amount']].sum().unstack(1)
s.columns = s.columns.droplevel(0)
s['row net'] = s.sum(1)
s.loc['column net'] = s.sum()

In [107]:
s.format_(['m0'] * 3)

                         Credit      Debit    Row Net
name 02
employee transaction   $370,686   $-13,089   $357,597
wageworks transaction   $12,094  $-395,262  $-383,168
column net             $382,780  $-408,351   $-25,571

In [108]:
s2 = csv_main.groupby('name 02')[['amount']].sum()
s2.loc['total'] = s2.sum()
s2.format_(['m0'])

                          Amount
name 02
employee transaction    $357,597
wageworks transaction  $-383,168
total                   $-25,571

### "Name 02" in-depth

In [109]:
ww_main = csv_main[csv_main['name 02'] == 'wageworks transaction']
ww = ww_main.groupby(['year and month','balance impact'])[['amount']].sum().unstack(1).fillna(0)

emp_main = csv_main[csv_main['name 02'] == 'employee transaction']
emp = emp_main.groupby(['year and month','balance impact'])[['amount']].sum().unstack(1).fillna(0)

In [110]:
ww.tail()

               amount
balance impact credit     debit
year and month
2018-01         121.0 -11181.75
2018-02           0.0 -10453.44
2018-03         116.5 -10645.44
2018-04         116.5 -10444.44
2018-05         134.0 -10444.44

In [111]:
emp.tail()

                 amount
balance impact   credit debit
year and month
2018-01         9808.68   0.0
2018-02         9762.08   0.0
2018-03         9501.48   0.0
2018-04         9278.08   0.0
2018-05         9269.22   0.0

In [102]:
csv_main['date'].max()

Timestamp('2018-06-01 00:00:00')

In [124]:
set(emp_main[emp_main['year and month'] == '2018-05']['date'])

{Timestamp('2018-05-04 00:00:00'), Timestamp('2018-05-18 00:00:00')}

In [126]:
emp_main[(emp_main['year and month'] == '2018-05')
            & (emp_main['name'] == 'abigail  torres')]['amount'].sum()

111.7

In [129]:
emp_main[emp_main['year and month'] == '2018-05'].groupby(['year and month','name'])[['amount']].sum().sort_values('amount')

                                         amount
year and month name
2018-05        garrett b. o'keefe         24.18
               stephanie a. donaghy       25.16
               martin r. rouse            55.38
               kenji j. mason             69.24
               jessie m. walker           74.76
               richard  amezquita         82.16
               angelica  reeve            83.38
               kelly e. devine            90.30
               andrew f. doro             92.30
               joshua p. szymanowski     104.88
               sharaya pender            107.54
               natasha torres            111.70
               monique k. williams       111.70
               michael rodriguez         111.70
               melanie rodriguez         111.70
               abigail  torres           111.70
               nicholas lapusan          111.70
               lorimar veras             111.70
               krystal smith             111.70
               kevin a. crystal          111.70
               kenesha c. bygrave        111.70
               lucy a. caputi            111.70
               nikki b. hershon          111.70
               noelle torres-cintron     111.70
               noel f. chao              111.70
               wilson feliciano          111.70
               william r. christopher    111.70
               veronika perez            111.70
               vance lewis               111.70
               thomas d. white           111.70
               stella c. striegel        111.70
               noah barrow               111.70
               stefan a. weiner          111.70
               shatema f. smith          111.70
               serge enama-nkama         111.70
               samantha flores           111.70
               ross j. o'farrell         111.70
               ramon l. echeverria       111.70
               olga rivera               111.70
               shiomara t. diaz          111.70
               yassine echchahly         111.70
               joshua lopez              111.70
               jonathan r. greaser       111.70
               christopher daley         111.70
               catherine m. humes        111.70
               carlo e. labrador         111.70
               brian w. cooper           111.70
               biniam tekola             111.70
               bernard t. baggett        111.70
               bernard casserly          111.70
               daigo w. kawasaki         111.70
               benjamin j. vander woude  111.70
               anthony l. blake          111.70
               angelina l. rodriguez     111.70
               angel l. rios             111.70
               alisha n. jimenez         111.70
               alisa d'alessandro        111.70
               alicia k. harder          111.70
               adrian m. quinn           111.70
               atira b. main             111.70
               jose cruz                 111.70
               daniel e. nosonowitz      111.70
               daniel quadri             111.70
               jennifer subervi          111.70
               jennifer a. balwan        111.70
               janine k. rizak           111.70
               james halliday            111.70
               ibrahim o. ouchikh        111.70
               hunter lombard            111.70
               evan m. stepanek          111.70
               daniel g. wall            111.70
               zephyr j. prusinski       111.70
               emily b. bautista         111.70
               emilio duvert             111.70
               eloise r. barrow          111.70
               dean m. miller            111.70
               david moore               111.70
               david  j. montano         111.70
               erika a. perez            111.70
               sebastian crisantos       120.00
               michele  santomauro       120.00
               luis m. pavon             158.20
               kristin m. grass          230.76
               theodore c. papes         235.38

In [84]:
ww_main[ww_main['year and month'] == '2018-02']

,type,date,num,name,memo,split,amount,balance,year and month,year,balance impact,name 02
6937,check,2018-02-06,NaN,commuter benefits wageworks,89 ccd id: 1943351864,10010 · chase chk - 1937,-10403.44,-32164.08,2018-02,2018,debit,wageworks transaction
7028,check,2018-02-23,NaN,wageworks/commuter express,93836 ccd id: 1943351864,10010 · chase chk - 1937,-50.00,-27202.74,2018-02,2018,debit,wageworks transaction

In [85]:
ww_main[ww_main['year and month'] == '2018-05']

,type,date,num,name,memo,split,amount,balance,year and month,year,balance impact,name 02
7545,check,2018-05-07,NaN,commuter benefits wageworks,18 ccd id: 1943351864,10010 · chase chk - 1937,-10444.44,-30264.82,2018-05,2018,debit,wageworks transaction
7546,deposit,2018-05-10,NaN,commuter benefits wageworks,79 ccd id: 1943351864,10010 · chase chk - 1937,13.00,-30251.82,2018-05,2018,credit,wageworks transaction
7547,deposit,2018-05-17,NaN,commuter benefits wageworks,42 ccd id: 1943351864,10010 · chase chk - 1937,121.00,-30130.82,2018-05,2018,credit,wageworks transaction

### Summary by year and month

In [55]:
by_month = csv_main.groupby(['year and month','name 2'])[['amount']].sum().unstack(1).fillna(0)
by_month.columns = by_month.columns.droplevel(0)
by_month['net'] = by_month.sum(1)
by_month['net as % of "wageworks trans"'] = by_month['net']/by_month['wageworks transaction']
by_month

name 2,employee transaction,wageworks transaction,net,"net as % of ""wageworks trans"""
year and month,,,,
2014-08,0.00,-4705.00,-4705.00,1.000000
2014-09,4467.40,-5569.00,-1101.60,0.197809
2014-10,5071.54,-5459.00,-387.46,0.070976
2014-11,5038.90,-5553.00,-514.10,0.092581
2014-12,5082.28,-5964.00,-881.72,0.147840
2015-01,8016.18,-6359.00,1657.18,-0.260604
2015-02,5556.41,-6200.00,-643.59,0.103805
2015-03,5356.24,-6653.00,-1296.76,0.194914
2015-04,5870.40,-7133.25,-1262.85,0.177037
2015-05,6407.40,-7188.25,-780.85,0.108629
2015-06,6430.48,-7319.25,-888.77,0.121429
2015-07,9593.00,-7552.75,2040.25,-0.270133
2015-08,6856.79,-7674.25,-817.46,0.106520
2015-09,6873.26,-6961.00,-87.74,0.012605
2015-10,6968.77,-7882.25,-913.48,0.115891
2015-11,7063.28,-8081.25,-1017.97,0.125967
2015-12,7077.23,-8049.75,-972.52,0.120814
2016-01,10810.07,-7867.25,2942.82,-0.374060
2016-02,7084.23,-7883.89,-799.66,0.101430
2016-03,6686.98,-7527.25,-840.27,0.111630
2016-04,6615.29,-7737.25,-1121.96,0.145008
2016-05,6606.31,-7372.75,-766.44,0.103956
2016-06,9519.66,-7746.75,1772.91,-0.228859
2016-07,6798.46,-8261.75,-1463.29,0.177116
2016-08,7202.08,-8491.25,-1289.17,0.151823
2016-09,7287.16,-8949.75,-1662.59,0.185769
2016-10,7438.57,-8949.75,-1511.18,0.168852
2016-11,7182.38,-9392.75,-2210.37,0.235327
2016-12,8029.32,-9514.25,-1484.93,0.156074
2017-01,8352.56,-9024.75,-672.19,0.074483
2017-02,8130.02,-8791.25,-661.23,0.075215
2017-03,8022.48,-9558.25,-1535.77,0.160675
2017-04,8658.50,-10286.75,-1628.25,0.158286
2017-05,8771.58,-10713.75,-1942.17,0.181278
2017-06,13698.28,-10383.25,3315.03,-0.319267
2017-07,9721.48,-10867.25,-1145.77,0.105433
2017-08,9526.96,-10981.75,-1454.79,0.132473
2017-09,9517.41,-10977.75,-1460.34,0.133027
2017-10,9594.47,-10767.75,-1173.28,0.108962
2017-11,9240.52,-11171.75,-1931.23,0.172867
2017-12,13753.16,-2963.17,10789.99,-3.641367
2018-01,9808.68,-11060.75,-1252.07,0.113199
2018-02,9762.08,-10453.44,-691.36,0.066137
2018-03,9501.48,-10528.94,-1027.46,0.097584
2018-04,9278.08,-10327.94,-1049.86,0.101652
2018-05,9269.22,-10310.44,-1041.22,0.100987
2018-06,4495.08,0.00,4495.08,inf

In [41]:
by_month.tail()

name 2          employee  not employee      net  net as % of "not employee"
year and month
2018-02          9762.08     -10453.44  -691.36                    0.066137
2018-03          9501.48     -10528.94 -1027.46                    0.097584
2018-04          9278.08     -10327.94 -1049.86                    0.101652
2018-05          9269.22     -10310.44 -1041.22                    0.100987
2018-06          4495.08          0.00  4495.08                         inf

### Summary by year

In [7]:
by_year = csv_main.groupby(['year','balance impact'])[['amount']].sum().unstack(1).fillna(0)
by_year.columns = by_year.columns.droplevel(0)
by_year['net'] = by_year.sum(1)
by_year['net as % of debit'] = by_year['net']/by_year['debit']
by_year

balance impact     credit      debit      net  net as % of debit
year
2014             33119.34  -40709.22 -7589.88           0.186441
2015             83323.48  -88308.04 -4984.56           0.056445
2016             91757.37 -100191.50 -8434.13           0.084180
2017            126472.50 -125972.50   500.00          -0.003969
2018             52602.62  -53169.51  -566.89           0.010662

### Splits

In [8]:
csv_main.groupby(['year','split'])[['amount']].sum().unstack(1).fillna(0)

                        amount
split 10010 · chase chk - 1937 66005 · service fee 66010 · taxes
year
2014                  -7589.88                 0.0           0.0
2015                  -4984.56                 0.0           0.0
2016                  -8434.13                 0.0           0.0
2017                  -7645.00              8145.0           0.0
2018                   -566.89                 0.0           0.0

### Just 2017, by date

In [9]:
df = csv_main[csv_main['year'] == '2017'].copy()
df.groupby(['date','balance impact'])[['amount']].sum().unstack(1)

                 amount
balance impact   credit     debit
date
2017-01-05          NaN  -9024.75
2017-01-13      4351.03       NaN
2017-01-27      4001.53       NaN
2017-02-07          NaN  -9024.75
2017-02-09       116.50       NaN
2017-02-10      4065.01       NaN
2017-02-16       117.00       NaN
2017-02-24      4065.01       NaN
2017-03-07          NaN  -9679.25
2017-03-09       121.00       NaN
2017-03-10      4011.24       NaN
2017-03-24      4011.24       NaN
2017-04-05          NaN -10286.75
2017-04-07      4329.25       NaN
2017-04-21      4329.25       NaN
2017-05-05      4329.25 -10829.75
2017-05-18       116.00       NaN
2017-05-19      4442.33       NaN
2017-06-02      4434.56       NaN
2017-06-06          NaN -10620.75
2017-06-08       121.00       NaN
2017-06-15       116.50       NaN
2017-06-16      4815.03       NaN
2017-06-30      4448.69       NaN
2017-07-06          NaN -10983.75
2017-07-13       116.50       NaN
2017-07-14      4713.62       NaN
2017-07-28      5007.86       NaN
2017-08-07          NaN -10981.75
2017-08-11      4763.48       NaN
2017-08-25      4763.48       NaN
2017-09-06          NaN -11093.75
2017-09-08      4763.48       NaN
2017-09-14         4.00       NaN
2017-09-21       112.00       NaN
2017-09-22      4753.93       NaN
2017-10-05          NaN -11093.75
2017-10-06      4825.16       NaN
2017-10-12       121.00       NaN
2017-10-20      4769.31       NaN
2017-10-25          NaN    -50.00
2017-10-26       255.00       NaN
2017-11-03      4581.68       NaN
2017-11-07          NaN -11171.75
2017-11-13       115.38       NaN
2017-11-17      4543.46       NaN
2017-12-01      4455.49       NaN
2017-12-05          NaN -11131.75
2017-12-07        23.58       NaN
2017-12-15      4768.34       NaN
2017-12-29      4529.33       NaN
2017-12-31      8145.00       NaN

In [10]:
csv_main[csv_main['date'] == '2017-12-05']

,type,date,num,name,memo,split,amount,balance,year and month,year,balance impact,name 2
6477,check,2017-12-05,NaN,commuter benefits wageworks,18 ccd id: 1943351864,10010 · chase chk - 1937,-11131.75,-37974.82,2017-12,2017,debit,not employee